task_lister/app/controllers/api/v1/lists_controller.rb

INSERT INTO "lists" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "New List 2"], ["created_at", "2017-12-19 17:38:44.231161"], ["updated_at", "2017-12-19 17:38:44.231161"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 14]]
---
  def destroy
    @list = List.find(params[:id])
    if @list
      # Task.where(list_id: @list.id).destroy_all
      @list.destroy