task_lister/app/controllers/api/v1/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("description", "priority", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "task 1"], ["priority", "low"], ["created_at", "2017-12-19 17:38:49.044968"], ["updated_at", "2017-12-19 17:38:49.044968"], ["list_id", 12]]

  def destroy
    @task = Task.find(params[:id])
    if @task
      @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 17]]