task_lister/app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "My List 2"], ["created_at", "2017-12-18 19:26:49.831934"], ["updated_at", "2017-12-18 19:26:49.831934"]]

  def destroy
    @list = List.find(params[:id])
    if @list
      Task.where(list_id: @list.id).destroy_all
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 2]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 6]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 5]]