task_lister/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "priority", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "My Task 2"], ["priority", "low"], ["list_id", "1"], ["created_at", "2017-12-18 19:44:09.962274"], ["updated_at", "2017-12-18 19:44:09.962274"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 11]]
---
  def destroy
    @task = Task.find(params[:id])
    if @task
      @task.destroy